-- Вставка тестовых данных
INSERT INTO domain_user (sid, name) VALUES 
('S-1-5-21-123', 'Петров Петр Петрович'),
('S-1-5-21-456', 'Сидоров Артем Сергеевич'),
('S-1-5-21-789', 'Смирнова Анна Николаевна'),
('S-1-5-21-112', 'Козлов Михаил Александрович'),
('S-1-5-21-134', 'Кузнецов Николай Данилович')

INSERT INTO domain_group (sid, name) VALUES 
('S-1-5-32-545', 'Все пользователи'),
('S-1-5-32-546', 'Отдел развития веб-решений'),
('S-1-5-32-123', 'Отдел разработки веб-решений'),
('S-1-5-32-456', 'Отдел разработки 1С решений')

INSERT INTO user_groups (id, user_id, group_id) VALUES 
('11', 'S-1-5-21-123', 'S-1-5-32-545'),
('11', 'S-1-5-21-456', 'S-1-5-32-545'),
('11', 'S-1-5-21-789', 'S-1-5-32-545'),
('11', 'S-1-5-21-112', 'S-1-5-32-545'),
('11', 'S-1-5-21-134', 'S-1-5-32-545'),
('11', 'S-1-5-21-123', 'S-1-5-32-546'),
('11', 'S-1-5-21-456', 'S-1-5-32-546'),
('11', 'S-1-5-21-789', 'S-1-5-32-123'),
('11', 'S-1-5-21-112', 'S-1-5-32-123'),
('11', 'S-1-5-21-134', 'S-1-5-32-456')